import 'package:prize/core/dummy/is_dummy.dart';
import 'package:prize/core/network/api_repo_handler.dart';
import 'package:prize/core/utils/common/future_result_of_typedef.dart';
import 'package:prize/core/utils/constants.dart';
import 'package:prize/core/utils/helper/cache_helper.dart';
import 'package:prize/features/splash/data/data_source/settings_api_service.dart';
import 'package:prize/features/splash/data/model/body/contact_us_body.dart';
import 'package:prize/features/splash/data/model/body/feedback_body.dart';
import 'package:prize/features/splash/data/model/force_update_model.dart';
import 'package:prize/features/splash/data/model/settings_model.dart';

class SettingsRepo {
  final SettingsApiService _settingsApiService;

  const SettingsRepo(this._settingsApiService);

  FutureResultOf<SettingsModel> getSettings() async {
    return ApiRepoHandler.execute(
      () async {
        final model = await _settingsApiService.getSettings();
        if (setDummyFromApi) isDummy = model.isDemo;
        return model;
      },
      dummy: () {
        return SettingsModel(
          currency: "جنيه",
          currencySymbol: "ج.م",
          email: "email.com",
          phone: "01102345",
          logoPath: "logoPath",
          privacyPolicy: "<h1><strong>سياسة الخصوصية</strong></h1>\n\n<p>آخر تحديث: 29 أبريل 2024</p>\n\n<p>تصف سياسة الخصوصية هذه سياساتنا وإجراءاتنا المتعلقة بجمع معلوماتك واستخدامها والكشف عنها عند استخدامك لخدمات <strong>Aqaryoun</strong>&nbsp;وتخبرك بحقوق الخصوصية الخاصة بك.</p>\n\n<p>باستخدام خدماتنا، فإنك توافق على جمع واستخدام المعلومات وفقًا لسياسة الخصوصية هذه.</p>\n\n<h1>جمع واستخدام بياناتك الشخصية</h1>\n\n<h2><strong>أنواع البيانات المجمعة</strong></h2>\n\n<h3><strong>- البيانات الشخصية</strong></h3>\n\n<p>أثناء استخدام خدمات<em> تطبيقات Aqaryoun</em>، قد نطلب منك تزويدنا بمعلومات تعريف شخصية معينة يمكن استخدامها للاتصال بك أو للتعرف عليك. قد تتضمن معلومات التعريف الشخصية ، على سبيل المثال لا الحصر:</p>\n\n<ul>\n\t<li>\n\t<p>عنوان البريد الإلكتروني</p>\n\t</li>\n\t<li>\n\t<p>الاسم</p>\n\t</li>\n\t<li>\n\t<p>رقم الهاتف</p>\n\t</li>\n\t<li>\n\t<p>الصور والمعلومات الأخرى من كاميرا جهازك ومكتبة الصور</p>\n\t</li>\n</ul>\n\n<p>نستخدم هذه المعلومات لتوفير ميزات&nbsp;وتحسين خدمتنا وتخصيصها وتوفير ميزات (مثل تحديد صورة الملف الشخصي لحسابك أو لقراءة رمز الاستجابة السريع في تطبيق Aqaryoun، على سبيل المثال لا الحصر)</p>\n\n<hr />\n<h2>&nbsp;</h2>\n\n<h2>استخدام بياناتك الشخصية</h2>\n\n<p>يجوز لنا استخدام البيانات الشخصية للأغراض التالية:</p>\n\n<ul>\n\t<li>\n\t<p><strong>لإدارة حسابك: </strong> لإدارة تسجيلك كمستخدم للخدمة.</p>\n\t</li>\n\t<li>\n\t<p><strong>لوظائف التطبيق:&nbsp;</strong>لعرض المحتوى المخصص لك.</p>\n\t</li>\n\t<li>\n\t<p><strong>للاتصال بك: </strong> للاتصال بك عن طريق البريد الإلكتروني أو المكالمات الهاتفية أو غير ذلك من أشكال الاتصالات الإلكترونية المماثلة.</p>\n\t</li>\n\t<li>\n\t<p><strong>لأغراض أخرى </strong>: قد نستخدم معلوماتك لأغراض أخرى ، مثل تحليل البيانات ، وتحديد اتجاهات الاستخدام ، وتحديد فعالية حملاتنا الترويجية ولتقييم وتحسين خدماتنا ومنتجاتنا وخدماتنا والتسويق وتجربتك.</p>\n\t</li>\n</ul>\n\n<p>قد نشارك معلوماتك الشخصية في المواقف التالية:</p>\n\n<ul>\n\t<li><strong>مع مقدمي الخدمة: </strong> قد نشارك معلوماتك الشخصية مع مزودي الخدمة لمراقبة وتحليل استخدام خدمتنا ، للاتصال بك.</li>\n\t<li><strong>لنقل الأعمال: </strong> يجوز لنا مشاركة معلوماتك الشخصية أو نقلها فيما يتعلق أو أثناء المفاوضات بشأن أي دمج أو بيع أصول الشركة أو التمويل أو الاستحواذ على كل أو جزء من عمل لشركة أخرى.</li>\n\t<li><strong>مع الشركات التابعة: </strong> قد نشارك معلوماتك مع الشركات التابعة لنا ، وفي هذه الحالة سنطلب من تلك الشركات التابعة احترام سياسة الخصوصية هذه. تشمل الشركات التابعة شركتنا الأم وأي شركات فرعية أخرى أو شركاء في المشاريع المشتركة أو شركات أخرى نسيطر عليها أو تخضع لسيطرة مشتركة معنا.</li>\n\t<li><strong>مع شركاء الأعمال: </strong> قد نشارك معلوماتك مع شركائنا في العمل لنقدم لك منتجات أو خدمات أو عروض ترويجية معينة.</li>\n\t<li><strong>مع مستخدمين آخرين: </strong> عندما تشارك معلومات شخصية أو تتفاعل بطريقة أخرى في المناطق العامة مع مستخدمين آخرين ، فقد يشاهد جميع المستخدمين هذه المعلومات وقد يتم توزيعها علنًا في الخارج.</li>\n\t<li><strong>بموافقتك </strong>: يجوز لنا الكشف عن معلوماتك الشخصية لأي غرض آخر بموافقتك.</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<hr />\n<h2>الاحتفاظ ببياناتك الشخصية</h2>\n\n<p>ستحتفظ الشركة ببياناتك الشخصية فقط طالما كان ذلك ضروريًا للأغراض المنصوص عليها في سياسة الخصوصية هذه. سنحتفظ ببياناتك الشخصية ونستخدمها بالقدر اللازم للامتثال لالتزاماتنا القانونية (على سبيل المثال ، إذا طُلب منا الاحتفاظ ببياناتك للامتثال للقوانين المعمول بها) ، وحل النزاعات ، وإنفاذ اتفاقياتنا وسياساتنا القانونية. <!--{C}%3C!%2D%2D%D8%B5%2D%2D%3E--></p>\n\n<p>ستحتفظ الشركة أيضًا ببيانات الاستخدام لأغراض التحليل الداخلي. بشكل عام ، يتم الاحتفاظ ببيانات الاستخدام لفترة زمنية أقصر ، إلا في حالة استخدام هذه البيانات لتعزيز الأمن أو لتحسين وظائف خدمتنا ، أو نحن ملزمون قانونًا بالاحتفاظ بهذه البيانات لفترات زمنية أطول.</p>\n\n<p>&nbsp;</p>\n\n<hr />\n<h2>نقل بياناتك الشخصية</h2>\n\n<p>تتم معالجة معلوماتك ، بما في ذلك البيانات الشخصية ، في مكاتب تشغيل الشركة وفي أي أماكن أخرى توجد بها الأطراف المشاركة في المعالجة. وهذا يعني أنه قد يتم نقل هذه المعلومات إلى - والاحتفاظ بها - على أجهزة الكمبيوتر الموجودة خارج ولايتك أو مقاطعتك أو بلدك أو أي ولاية قضائية حكومية أخرى حيث قد تختلف قوانين حماية البيانات عن تلك الموجودة في ولايتك القضائية.</p>\n\n<p>موافقتك على سياسة الخصوصية هذه متبوعة بإرسالك تمثل هذه المعلومات موافقتك على هذا النقل.</p>\n\n<p>ستتخذ Aqaryoun جميع الخطوات اللازمة بشكل معقول لضمان التعامل مع بياناتك بشكل آمن ووفقًا لسياسة الخصوصية هذه ولن يتم نقل بياناتك الشخصية إلى منظمة أو دولة ما لم تكن هناك ضوابط كافية مطبقة بما في ذلك أمان بياناتك والمعلومات الشخصية الأخرى.</p>\n\n<p>&nbsp;</p>\n\n<hr />\n<h2>حذف بياناتك الشخصية</h2>\n\n<p>لديك الحق في حذف أو طلب مساعدتنا في حذف البيانات الشخصية التي جمعناها عنك.</p>\n\n<p>قد تمنحك خدمتنا القدرة على حذف معلومات معينة عنك من داخل الخدمة.</p>\n\n<p>يمكنك تحديث معلوماتك أو تعديلها أو حذفها في أي وقت عن طريق تسجيل الدخول إلى حسابك ، إذا كان لديك حساب ، وزيارة قسم إعدادات الحساب الذي يسمح لك بإدارة معلوماتك الشخصية ثم التواصل معنا لحذف بياناتك الشخصية. كما يمكنك أيضًا الاتصال بنا لطلب الوصول إلى أي معلومات شخصية قدمتها لنا أو تصحيحها أو حذفها.</p>\n\n<p>ومع ذلك ، يرجى ملاحظة أننا قد نحتاج إلى الاحتفاظ بمعلومات معينة عندما يكون لدينا التزام قانوني أو أساس قانوني للقيام بذلك.</p>\n\n<p>&nbsp;</p>\n\n<hr />\n<h1>أمان بياناتك الشخصية</h1>\n\n<p>يعد أمان بياناتك الشخصية أمرًا مهمًا بالنسبة لنا ، ولكن تذكر أنه لا توجد طريقة نقل عبر الإنترنت أو طريقة تخزين إلكتروني آمنة بنسبة 100٪. بينما نسعى جاهدين لاستخدام وسائل مقبولة تجاريًا لحماية بياناتك الشخصية ، لا يمكننا ضمان أمنها المطلق.</p>\n\n<h1>خصوصية الأطفال</h1>\n\n<p>لا تخاطب خدمتنا أي شخص يقل عمره عن 13 عامًا. نحن لا نجمع عن قصد معلومات تعريف شخصية من أي شخص يقل عمره عن 13 عامًا. إذا كنت أحد الوالدين أو الوصي وتدرك أن طفلك قد زودنا بمعلومات شخصية البيانات ، يرجى الاتصال بنا. إذا علمنا أننا قد جمعنا بيانات شخصية من أي شخص يقل عمره عن 13 عامًا دون التحقق من موافقة الوالدين ، فإننا نتخذ خطوات لإزالة هذه المعلومات من خوادمنا.</p>\n\n<p>إذا احتجنا إلى الاعتماد على الموافقة كأساس قانوني لمعالجة معلوماتك وكان بلدك يتطلب موافقة أحد الوالدين ، فقد نطلب موافقة والديك قبل أن نجمع هذه المعلومات ونستخدمها.</p>\n\n<h1>روابط لمواقع أخرى</h1>\n\n<p>قد تحتوي خدمتنا على روابط لمواقع أخرى لا نقوم بتشغيلها. إذا قمت بالنقر فوق ارتباط جهة خارجية ، فسيتم توجيهك إلى موقع الطرف الثالث. ننصحك بشدة بمراجعة سياسة الخصوصية لكل موقع تزوره.</p>\n\n<p>ليس لدينا أي سيطرة ولا نتحمل أي مسؤولية عن المحتوى أو سياسات الخصوصية أو ممارسات أي مواقع أو خدمات تابعة لجهات خارجية.</p>\n\n<p>&nbsp;</p>\n\n<hr />\n<h1>التغييرات في سياسة الخصوصية هذه</h1>\n\n<p>قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. سنخطرك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة.</p>\n\n<p>سنخبرك عبر البريد الإلكتروني و / أو إشعارًا بارزًا على &quot;خدمتنا&quot; ، قبل أن يصبح التغيير ساريًا ونقوم بتحديث؛ آخر تحديث؛ التاريخ في الجزء العلوي من سياسة الخصوصية هذه.</p>\n\n<p>يُنصح بمراجعة سياسة الخصوصية هذه بشكل دوري لمعرفة أي تغييرات. تسري التغييرات التي تطرأ على سياسة الخصوصية هذه عند نشرها على هذه الصفحة.</p>\n",
          aboutUs: "aboutUs HTML page",
          termsOfUse: "<h1>شروط الاستخدام</h1><p>توضح هذه الشروط كيفية استخدام التطبيق...</p>",
          termsAndConditions: "<h1>الشروط والأحكام</h1><p>توضح هذه الشروط كيفية استخدام التطبيق...</p>",
          contactUs: "contactUs HTML page",
          faq: [],
          isDemo: true,
          forceUpdate: ForceUpdateModel.empty(),
          maintenance: null,
        );
      },
    );
  }

  FutureResultOf<void> contactUs(ContactUsBody body) async {
    return ApiRepoHandler.execute(() async => await _settingsApiService.contactUs(body));
  }

  FutureResultOf<void> feedback(FeedbackBody body) async {
    return ApiRepoHandler.execute(() async => await _settingsApiService.feedback(body));
  }

  bool isFirstLaunch() {
    return CacheHelper.getBool(AppStrings.isFirstOpen) == true;
  }

  Future<void> setFirstLaunch([bool value = false]) async {
    await CacheHelper.setData(AppStrings.isFirstOpen, value);
  }
}
